function sortList() {
    var list, i, switching, b, shouldSwitch;
    list = document.getElementById("id01");
    switching = true;
    //یک حلقه ایجاد می کنیم که تا زمانی که دیگه نیاز به تغییر نباشه ادامه پیدا کند
    // که این کار را توسط مقدار دهی درست و غلط به متغیر سوییچینگ هندل می کنیم
  
    while (switching) {
      //در ابتدا مقدار متغیر سوییچینگ را به نشانه اینکه هیج تغییری انجام نشده نادرست می گذاریم
  
      switching = false;
      //کل تگ های لیست آیتم را داخل متغیر قرار می دهیم
  
      b = list.getElementsByTagName("LI");
      //یک حلقه بر روی تمام لیست آیتم ها می زنیم
  
      for (i = 0; i < b.length - 1; i++) {
        // در ابتدا مقدار متغیر زیر را نادرست قرار می دهیم
        //به نشانه اینکه نباید تغییری صورت بگیرد و در ادامه با یک شرط عملیات تغییر دادن را بررسی می کنیم
        shouldSwitch = false;
        // توسط شرط زیر ایتدا محتویات داخل هر آیتم لیست را با آیتم بعدیش مقایسه می کنیم
        // و اگر متغیر دومی از لحاط الفبایی کوچکتر از آیتم قبلی بود پس نتیجه می گیریم باید جابه جایی (سوییچ) انجام شود
  
        if (b[i].innerHTML.toLowerCase() > b[i + 1].innerHTML.toLowerCase()) {
          // .با توجه به شرط بالا مقدار متغیر را به نشانه اینکه باید سوییچ انجام شود ،درست قرار میدهیم
          //با دستور برک حلقه را پایان می دهیم
          shouldSwitch = true;
          break;
        }
      }
  
      //تا زمانی که مقدار متغیرمان صحیح هست عملیات سوییچ را انجام بده
      if (shouldSwitch) {
        //existingNode.parentNode.insertBefore(newNode, existingNode);
        //داخل پرنت لیست آیتم ها جایگاه آیتم بعدی را قبل از آیتم اول قرار بده  .parentnode
        // دوتا ورودی می گیره مقدار اول آیتم ای که می خواد جابه جا بشود.insertBefore
        // مقدار دوم جایگاهی که آیتم اول قبل از آن قرار میگیرد
        b[i].parentNode.insertBefore(b[i + 1], b[i]);
        //مقدار سوییچینگ را صحیح قرار می دهیم که دوباره وارد حلقه وایل بشود
        switching = true;
      }
    }
  }
  